app/controllers/images_controller.rb

INSERT INTO "images" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "asdsdbc@mail.com"], ["created_at", "2021-11-13 22:57:17.679951"], ["updated_at", "2021-11-13 22:57:17.679951"]]
---
  def compress
    @image = Image.new(image_params)
    if @image.save

SELECT "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", "6d56252f-ef61-4c64-a6ab-2fa75fb289b5"], ["LIMIT", 1]]
---
  def set_image
    @image = Image.find(params[:id])